test_postgresql/10000user_10threads.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 10 tps: 1291.53 qps: 26018.07 (r/w/o: 18229.01/5186.06/2603.00) lat (ms,95%): 12.75 err/s: 2.99 reconn/s: 0.00
[ 2s ] thds: 10 tps: 2006.35 qps: 40231.01 (r/w/o: 28176.91/8018.40/4035.70) lat (ms,95%): 7.43 err/s: 7.00 reconn/s: 0.00
[ 3s ] thds: 10 tps: 2029.08 qps: 40758.55 (r/w/o: 28550.08/8117.31/4091.16) lat (ms,95%): 7.04 err/s: 8.00 reconn/s: 0.00
[ 4s ] thds: 10 tps: 2049.18 qps: 41058.69 (r/w/o: 28737.58/8202.74/4118.37) lat (ms,95%): 7.30 err/s: 6.00 reconn/s: 0.00
[ 5s ] thds: 10 tps: 2096.82 qps: 42047.38 (r/w/o: 29447.47/8383.28/4216.64) lat (ms,95%): 7.04 err/s: 4.00 reconn/s: 0.00
[ 6s ] thds: 10 tps: 2100.19 qps: 42082.72 (r/w/o: 29462.61/8389.74/4230.37) lat (ms,95%): 7.04 err/s: 6.00 reconn/s: 0.00
[ 7s ] thds: 10 tps: 2058.84 qps: 41399.84 (r/w/o: 29000.79/8244.37/4154.68) lat (ms,95%): 7.17 err/s: 13.00 reconn/s: 0.00
[ 8s ] thds: 10 tps: 2086.03 qps: 41858.53 (r/w/o: 29305.37/8350.11/4203.05) lat (ms,95%): 7.17 err/s: 7.00 reconn/s: 0.00
[ 9s ] thds: 10 tps: 1992.99 qps: 39995.84 (r/w/o: 28006.89/7967.97/4020.98) lat (ms,95%): 7.43 err/s: 8.00 reconn/s: 0.00
[ 10s ] thds: 10 tps: 1874.78 qps: 37680.18 (r/w/o: 26395.58/7506.10/3778.49) lat (ms,95%): 9.06 err/s: 8.98 reconn/s: 0.00
[ 11s ] thds: 10 tps: 1920.42 qps: 38449.47 (r/w/o: 26912.93/7664.64/3871.91) lat (ms,95%): 8.28 err/s: 5.01 reconn/s: 0.00
[ 12s ] thds: 10 tps: 1993.95 qps: 40017.97 (r/w/o: 28024.28/7976.79/4016.90) lat (ms,95%): 7.43 err/s: 8.00 reconn/s: 0.00
[ 13s ] thds: 10 tps: 2016.02 qps: 40479.31 (r/w/o: 28346.22/8069.06/4064.03) lat (ms,95%): 7.30 err/s: 8.00 reconn/s: 0.00
[ 14s ] thds: 10 tps: 2072.00 qps: 41595.97 (r/w/o: 29131.98/8289.99/4174.00) lat (ms,95%): 7.30 err/s: 8.00 reconn/s: 0.00
[ 15s ] thds: 10 tps: 2059.08 qps: 41293.63 (r/w/o: 28915.14/8227.32/4151.16) lat (ms,95%): 7.30 err/s: 6.00 reconn/s: 0.00
[ 16s ] thds: 10 tps: 1880.08 qps: 37657.55 (r/w/o: 26363.08/7506.34/3788.13) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 17s ] thds: 10 tps: 1983.95 qps: 39805.13 (r/w/o: 27870.40/7932.80/4001.93) lat (ms,95%): 7.56 err/s: 8.01 reconn/s: 0.00
[ 18s ] thds: 10 tps: 1960.28 qps: 39329.58 (r/w/o: 27539.90/7836.13/3953.55) lat (ms,95%): 8.58 err/s: 6.00 reconn/s: 0.00
[ 19s ] thds: 10 tps: 1928.66 qps: 38735.20 (r/w/o: 27133.25/7711.63/3890.33) lat (ms,95%): 7.70 err/s: 10.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 1985.01 qps: 39762.13 (r/w/o: 27839.09/7934.03/3989.01) lat (ms,95%): 7.56 err/s: 4.00 reconn/s: 0.00
[ 21s ] thds: 10 tps: 1773.42 qps: 35606.21 (r/w/o: 24927.74/7106.65/3571.81) lat (ms,95%): 9.22 err/s: 5.00 reconn/s: 0.00
[ 22s ] thds: 10 tps: 1810.53 qps: 36353.77 (r/w/o: 25462.55/7237.12/3654.09) lat (ms,95%): 8.90 err/s: 8.01 reconn/s: 0.00
[ 23s ] thds: 10 tps: 164.68 qps: 3264.65 (r/w/o: 2286.55/643.75/334.35) lat (ms,95%): 846.57 err/s: 1.00 reconn/s: 0.00
[ 24s ] thds: 10 tps: 1176.96 qps: 23641.36 (r/w/o: 16553.56/4716.85/2370.95) lat (ms,95%): 13.22 err/s: 4.01 reconn/s: 0.00
[ 25s ] thds: 10 tps: 1776.40 qps: 35647.96 (r/w/o: 24962.56/7107.61/3577.78) lat (ms,95%): 10.09 err/s: 5.99 reconn/s: 0.00
[ 26s ] thds: 10 tps: 1995.50 qps: 39973.13 (r/w/o: 27987.10/7973.00/4013.03) lat (ms,95%): 7.70 err/s: 6.01 reconn/s: 0.00
[ 27s ] thds: 10 tps: 1880.89 qps: 37729.79 (r/w/o: 26421.45/7524.57/3783.77) lat (ms,95%): 9.22 err/s: 5.00 reconn/s: 0.00
[ 28s ] thds: 10 tps: 1774.20 qps: 35573.88 (r/w/o: 24913.71/7089.79/3570.38) lat (ms,95%): 9.91 err/s: 4.00 reconn/s: 0.00
[ 29s ] thds: 10 tps: 962.95 qps: 19333.15 (r/w/o: 13538.41/3857.82/1936.92) lat (ms,95%): 7.56 err/s: 2.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 585.89 qps: 11743.74 (r/w/o: 8216.43/2345.55/1181.76) lat (ms,95%): 14.73 err/s: 3.99 reconn/s: 0.00
[ 31s ] thds: 10 tps: 1588.15 qps: 31817.09 (r/w/o: 22280.18/6336.57/3200.35) lat (ms,95%): 10.46 err/s: 4.01 reconn/s: 0.00
[ 32s ] thds: 10 tps: 1833.88 qps: 36891.65 (r/w/o: 25831.35/7349.53/3710.76) lat (ms,95%): 8.28 err/s: 13.00 reconn/s: 0.00
[ 33s ] thds: 10 tps: 1893.61 qps: 38010.88 (r/w/o: 26630.28/7567.44/3813.17) lat (ms,95%): 7.70 err/s: 6.99 reconn/s: 0.00
[ 34s ] thds: 10 tps: 1829.95 qps: 36690.05 (r/w/o: 25690.33/7324.81/3674.90) lat (ms,95%): 8.28 err/s: 3.00 reconn/s: 0.00
[ 35s ] thds: 10 tps: 1946.69 qps: 39109.06 (r/w/o: 27383.86/7800.77/3924.43) lat (ms,95%): 7.84 err/s: 9.02 reconn/s: 0.00
[ 36s ] thds: 10 tps: 2037.86 qps: 40799.25 (r/w/o: 28557.07/8128.45/4113.72) lat (ms,95%): 7.30 err/s: 7.00 reconn/s: 0.00
[ 37s ] thds: 10 tps: 2040.13 qps: 40891.70 (r/w/o: 28636.89/8156.54/4098.27) lat (ms,95%): 7.43 err/s: 5.00 reconn/s: 0.00
[ 38s ] thds: 10 tps: 1945.67 qps: 39239.44 (r/w/o: 27481.40/7826.69/3931.34) lat (ms,95%): 7.43 err/s: 11.00 reconn/s: 0.00
[ 39s ] thds: 10 tps: 1760.25 qps: 35297.96 (r/w/o: 24733.47/7005.98/3558.50) lat (ms,95%): 7.43 err/s: 8.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 1995.00 qps: 40182.98 (r/w/o: 28152.99/7987.00/4043.00) lat (ms,95%): 7.56 err/s: 16.00 reconn/s: 0.00
[ 41s ] thds: 10 tps: 2037.88 qps: 40947.61 (r/w/o: 28668.33/8160.52/4118.76) lat (ms,95%): 7.56 err/s: 12.00 reconn/s: 0.00
[ 42s ] thds: 10 tps: 2024.95 qps: 40732.97 (r/w/o: 28529.28/8105.80/4097.90) lat (ms,95%): 7.56 err/s: 13.00 reconn/s: 0.00
[ 43s ] thds: 10 tps: 1935.16 qps: 38879.27 (r/w/o: 27233.29/7737.65/3908.33) lat (ms,95%): 7.70 err/s: 10.00 reconn/s: 0.00
[ 44s ] thds: 10 tps: 1969.06 qps: 39522.14 (r/w/o: 27676.80/7880.23/3965.11) lat (ms,95%): 7.70 err/s: 9.00 reconn/s: 0.00
[ 45s ] thds: 10 tps: 2036.61 qps: 40945.07 (r/w/o: 28678.44/8159.42/4107.20) lat (ms,95%): 7.43 err/s: 10.00 reconn/s: 0.00
[ 46s ] thds: 10 tps: 1990.05 qps: 39919.02 (r/w/o: 27948.72/7967.20/4003.10) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 47s ] thds: 10 tps: 2008.32 qps: 40421.54 (r/w/o: 28320.58/8046.30/4054.66) lat (ms,95%): 7.56 err/s: 13.00 reconn/s: 0.00
[ 48s ] thds: 10 tps: 1904.00 qps: 38176.07 (r/w/o: 26727.05/7618.01/3831.01) lat (ms,95%): 7.84 err/s: 8.00 reconn/s: 0.00
[ 49s ] thds: 10 tps: 1978.76 qps: 39691.25 (r/w/o: 27793.67/7912.05/3985.52) lat (ms,95%): 7.43 err/s: 2.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 2034.08 qps: 40725.53 (r/w/o: 28508.07/8122.30/4095.15) lat (ms,95%): 7.30 err/s: 5.00 reconn/s: 0.00
[ 51s ] thds: 10 tps: 2056.17 qps: 41238.50 (r/w/o: 28885.45/8205.70/4147.35) lat (ms,95%): 7.17 err/s: 6.00 reconn/s: 0.00
[ 52s ] thds: 10 tps: 2029.03 qps: 40809.62 (r/w/o: 28583.44/8132.12/4094.06) lat (ms,95%): 7.43 err/s: 13.00 reconn/s: 0.00
[ 53s ] thds: 10 tps: 2048.97 qps: 41104.44 (r/w/o: 28775.61/8204.89/4123.94) lat (ms,95%): 7.30 err/s: 5.00 reconn/s: 0.00
[ 54s ] thds: 10 tps: 1946.76 qps: 39076.20 (r/w/o: 27371.64/7775.05/3929.52) lat (ms,95%): 7.84 err/s: 10.00 reconn/s: 0.00
[ 55s ] thds: 10 tps: 1864.23 qps: 37378.57 (r/w/o: 26168.20/7458.91/3751.46) lat (ms,95%): 8.13 err/s: 4.00 reconn/s: 0.00
[ 56s ] thds: 10 tps: 2023.97 qps: 40731.45 (r/w/o: 28532.61/8104.89/4093.94) lat (ms,95%): 7.43 err/s: 16.00 reconn/s: 0.00
[ 57s ] thds: 10 tps: 2010.25 qps: 40421.62 (r/w/o: 28309.21/8053.98/4058.43) lat (ms,95%): 7.43 err/s: 10.98 reconn/s: 0.00
[ 58s ] thds: 10 tps: 1778.26 qps: 35656.28 (r/w/o: 24962.70/7106.01/3587.57) lat (ms,95%): 8.43 err/s: 8.01 reconn/s: 0.00
[ 59s ] thds: 10 tps: 1957.09 qps: 39307.79 (r/w/o: 27532.25/7837.36/3938.18) lat (ms,95%): 7.56 err/s: 5.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 1863.87 qps: 37492.44 (r/w/o: 26260.21/7465.49/3766.74) lat (ms,95%): 8.13 err/s: 12.00 reconn/s: 0.00
[ 61s ] thds: 10 tps: 1911.88 qps: 38412.68 (r/w/o: 26909.37/7644.54/3858.77) lat (ms,95%): 7.70 err/s: 10.00 reconn/s: 0.00
[ 62s ] thds: 10 tps: 2027.27 qps: 40731.37 (r/w/o: 28522.76/8115.07/4093.54) lat (ms,95%): 7.43 err/s: 13.00 reconn/s: 0.00
[ 63s ] thds: 10 tps: 1980.01 qps: 39792.13 (r/w/o: 27868.09/7924.03/4000.01) lat (ms,95%): 7.56 err/s: 10.00 reconn/s: 0.00
[ 64s ] thds: 10 tps: 1945.94 qps: 39031.76 (r/w/o: 27327.13/7777.75/3926.88) lat (ms,95%): 7.70 err/s: 6.00 reconn/s: 0.00
[ 65s ] thds: 10 tps: 1771.47 qps: 35678.16 (r/w/o: 25008.38/7084.88/3584.90) lat (ms,95%): 8.74 err/s: 11.99 reconn/s: 0.00
[ 66s ] thds: 10 tps: 1808.64 qps: 36345.92 (r/w/o: 25444.04/7255.57/3646.30) lat (ms,95%): 8.28 err/s: 9.01 reconn/s: 0.00
[ 67s ] thds: 10 tps: 1985.81 qps: 39804.20 (r/w/o: 27871.34/7929.24/4003.62) lat (ms,95%): 8.74 err/s: 5.00 reconn/s: 0.00
[ 68s ] thds: 10 tps: 1893.16 qps: 37972.16 (r/w/o: 26590.21/7565.63/3816.32) lat (ms,95%): 8.43 err/s: 6.00 reconn/s: 0.00
[ 69s ] thds: 10 tps: 1976.98 qps: 39602.56 (r/w/o: 27717.69/7907.91/3976.96) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 1976.09 qps: 39642.76 (r/w/o: 27769.23/7894.35/3979.18) lat (ms,95%): 9.06 err/s: 6.00 reconn/s: 0.00
[ 71s ] thds: 10 tps: 2049.77 qps: 41101.49 (r/w/o: 28783.84/8188.10/4129.55) lat (ms,95%): 7.56 err/s: 8.00 reconn/s: 0.00
[ 72s ] thds: 10 tps: 2063.09 qps: 41331.86 (r/w/o: 28922.30/8253.37/4156.19) lat (ms,95%): 7.30 err/s: 6.00 reconn/s: 0.00
[ 73s ] thds: 10 tps: 2047.00 qps: 41103.98 (r/w/o: 28793.98/8187.00/4123.00) lat (ms,95%): 7.43 err/s: 8.00 reconn/s: 0.00
[ 74s ] thds: 10 tps: 2044.07 qps: 41141.38 (r/w/o: 28822.97/8187.28/4131.14) lat (ms,95%): 7.43 err/s: 13.00 reconn/s: 0.00
[ 75s ] thds: 10 tps: 1992.02 qps: 40051.36 (r/w/o: 28050.25/7976.07/4025.04) lat (ms,95%): 7.43 err/s: 11.00 reconn/s: 0.00
[ 76s ] thds: 10 tps: 1959.87 qps: 39372.49 (r/w/o: 27578.24/7828.50/3965.75) lat (ms,95%): 8.58 err/s: 11.00 reconn/s: 0.00
[ 77s ] thds: 10 tps: 1826.66 qps: 36619.09 (r/w/o: 25634.16/7300.65/3684.28) lat (ms,95%): 8.74 err/s: 6.99 reconn/s: 0.00
[ 78s ] thds: 10 tps: 1974.48 qps: 39725.85 (r/w/o: 27834.92/7901.94/3989.00) lat (ms,95%): 7.70 err/s: 10.01 reconn/s: 0.00
[ 79s ] thds: 10 tps: 1877.99 qps: 37617.78 (r/w/o: 26327.84/7512.95/3776.99) lat (ms,95%): 8.43 err/s: 5.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 1908.09 qps: 38302.78 (r/w/o: 26819.25/7635.36/3848.18) lat (ms,95%): 7.98 err/s: 8.00 reconn/s: 0.00
[ 81s ] thds: 10 tps: 2004.02 qps: 40223.42 (r/w/o: 28177.29/8014.08/4032.04) lat (ms,95%): 7.56 err/s: 6.00 reconn/s: 0.00
[ 82s ] thds: 10 tps: 2062.00 qps: 41420.08 (r/w/o: 29008.06/8248.02/4164.01) lat (ms,95%): 7.17 err/s: 10.00 reconn/s: 0.00
[ 83s ] thds: 10 tps: 2060.83 qps: 41299.53 (r/w/o: 28915.57/8231.31/4152.65) lat (ms,95%): 7.17 err/s: 5.00 reconn/s: 0.00
[ 84s ] thds: 10 tps: 2002.08 qps: 40150.55 (r/w/o: 28108.08/8013.31/4029.16) lat (ms,95%): 7.43 err/s: 6.00 reconn/s: 0.00
[ 85s ] thds: 10 tps: 2032.28 qps: 40833.34 (r/w/o: 28601.71/8133.13/4098.51) lat (ms,95%): 7.30 err/s: 9.98 reconn/s: 0.00
[ 86s ] thds: 10 tps: 2001.36 qps: 40085.24 (r/w/o: 28060.07/8000.42/4024.75) lat (ms,95%): 7.43 err/s: 3.01 reconn/s: 0.00
[ 87s ] thds: 10 tps: 1978.28 qps: 39554.53 (r/w/o: 27681.87/7891.10/3981.56) lat (ms,95%): 7.56 err/s: 4.00 reconn/s: 0.00
[ 88s ] thds: 10 tps: 1966.64 qps: 39547.76 (r/w/o: 27706.93/7871.56/3969.27) lat (ms,95%): 7.70 err/s: 8.00 reconn/s: 0.00
[ 89s ] thds: 10 tps: 259.57 qps: 5255.21 (r/w/o: 3688.83/1044.25/522.13) lat (ms,95%): 7.04 err/s: 1.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 1140.49 qps: 22905.91 (r/w/o: 16034.94/4564.96/2306.01) lat (ms,95%): 13.70 err/s: 8.01 reconn/s: 0.00
[ 91s ] thds: 10 tps: 447.32 qps: 9004.32 (r/w/o: 6320.40/1781.29/902.63) lat (ms,95%): 8.74 err/s: 1.00 reconn/s: 0.00
[ 92s ] thds: 10 tps: 1054.92 qps: 21156.54 (r/w/o: 14803.97/4217.68/2134.89) lat (ms,95%): 13.46 err/s: 7.01 reconn/s: 0.00
[ 93s ] thds: 10 tps: 1859.54 qps: 37334.83 (r/w/o: 26145.59/7441.16/3748.09) lat (ms,95%): 8.13 err/s: 7.00 reconn/s: 0.00
[ 94s ] thds: 10 tps: 2004.02 qps: 40247.48 (r/w/o: 28187.34/8021.10/4039.05) lat (ms,95%): 7.43 err/s: 8.00 reconn/s: 0.00
[ 95s ] thds: 10 tps: 2011.01 qps: 40408.20 (r/w/o: 28294.14/8046.04/4068.02) lat (ms,95%): 7.43 err/s: 14.00 reconn/s: 0.00
[ 96s ] thds: 10 tps: 2025.00 qps: 40721.06 (r/w/o: 28537.04/8104.01/4080.01) lat (ms,95%): 7.84 err/s: 9.00 reconn/s: 0.00
[ 97s ] thds: 10 tps: 2002.92 qps: 40166.25 (r/w/o: 28117.77/8009.70/4038.78) lat (ms,95%): 7.84 err/s: 7.98 reconn/s: 0.00
[ 98s ] thds: 10 tps: 1822.75 qps: 36475.94 (r/w/o: 25528.45/7288.98/3658.51) lat (ms,95%): 9.91 err/s: 1.00 reconn/s: 0.00
[ 99s ] thds: 10 tps: 2033.06 qps: 40809.29 (r/w/o: 28593.92/8123.24/4092.14) lat (ms,95%): 7.70 err/s: 6.00 reconn/s: 0.00
[ 100s ] thds: 10 tps: 1962.65 qps: 39391.88 (r/w/o: 27582.02/7845.58/3964.28) lat (ms,95%): 7.43 err/s: 8.00 reconn/s: 0.00
[ 101s ] thds: 10 tps: 2057.40 qps: 41329.94 (r/w/o: 28937.56/8242.58/4149.80) lat (ms,95%): 7.30 err/s: 10.00 reconn/s: 0.00
[ 102s ] thds: 10 tps: 2062.86 qps: 41379.24 (r/w/o: 28972.06/8249.45/4157.72) lat (ms,95%): 7.17 err/s: 8.00 reconn/s: 0.00
[ 103s ] thds: 10 tps: 1933.71 qps: 38823.00 (r/w/o: 27192.79/7729.82/3900.39) lat (ms,95%): 7.70 err/s: 7.99 reconn/s: 0.00
[ 104s ] thds: 10 tps: 2069.52 qps: 41492.41 (r/w/o: 29048.29/8279.07/4165.05) lat (ms,95%): 7.30 err/s: 8.01 reconn/s: 0.00
[ 105s ] thds: 10 tps: 2011.99 qps: 40374.82 (r/w/o: 28272.87/8055.96/4045.98) lat (ms,95%): 7.43 err/s: 4.00 reconn/s: 0.00
[ 106s ] thds: 10 tps: 1948.89 qps: 39165.79 (r/w/o: 27434.45/7799.56/3931.78) lat (ms,95%): 7.70 err/s: 10.00 reconn/s: 0.00
[ 107s ] thds: 10 tps: 1974.09 qps: 39660.82 (r/w/o: 27771.27/7899.36/3990.18) lat (ms,95%): 7.70 err/s: 12.00 reconn/s: 0.00
[ 108s ] thds: 10 tps: 1864.78 qps: 37439.55 (r/w/o: 26216.88/7470.11/3752.55) lat (ms,95%): 8.13 err/s: 6.00 reconn/s: 0.00
[ 109s ] thds: 10 tps: 1699.87 qps: 34102.29 (r/w/o: 23890.07/6782.53/3429.69) lat (ms,95%): 9.39 err/s: 5.99 reconn/s: 0.00
[ 110s ] thds: 10 tps: 1849.15 qps: 37048.12 (r/w/o: 25933.18/7390.59/3724.35) lat (ms,95%): 9.22 err/s: 6.01 reconn/s: 0.00
[ 111s ] thds: 10 tps: 1897.50 qps: 38116.05 (r/w/o: 26691.04/7598.00/3827.01) lat (ms,95%): 8.43 err/s: 10.00 reconn/s: 0.00
[ 112s ] thds: 10 tps: 1941.99 qps: 38962.88 (r/w/o: 27286.92/7763.98/3911.99) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 113s ] thds: 10 tps: 1948.02 qps: 39046.39 (r/w/o: 27342.28/7776.08/3928.04) lat (ms,95%): 7.84 err/s: 5.00 reconn/s: 0.00
[ 114s ] thds: 10 tps: 2032.89 qps: 40722.71 (r/w/o: 28509.40/8125.54/4087.77) lat (ms,95%): 7.43 err/s: 4.00 reconn/s: 0.00
[ 115s ] thds: 10 tps: 1961.01 qps: 39355.20 (r/w/o: 27551.14/7858.04/3946.02) lat (ms,95%): 7.56 err/s: 7.00 reconn/s: 0.00
[ 116s ] thds: 10 tps: 2001.98 qps: 40179.64 (r/w/o: 28145.75/7993.93/4039.96) lat (ms,95%): 7.56 err/s: 9.00 reconn/s: 0.00
[ 117s ] thds: 10 tps: 2035.02 qps: 40900.48 (r/w/o: 28638.34/8154.10/4108.05) lat (ms,95%): 7.43 err/s: 11.00 reconn/s: 0.00
[ 118s ] thds: 10 tps: 1949.63 qps: 39131.46 (r/w/o: 27415.71/7792.52/3923.24) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
[ 119s ] thds: 10 tps: 1968.31 qps: 39459.19 (r/w/o: 27613.33/7866.22/3979.64) lat (ms,95%): 7.70 err/s: 9.01 reconn/s: 0.00
[ 120s ] thds: 10 tps: 1893.86 qps: 37993.26 (r/w/o: 26609.08/7573.45/3810.73) lat (ms,95%): 8.13 err/s: 6.00 reconn/s: 0.00
[ 121s ] thds: 10 tps: 1637.09 qps: 32897.88 (r/w/o: 23047.32/6556.38/3294.19) lat (ms,95%): 8.90 err/s: 4.00 reconn/s: 0.00
[ 122s ] thds: 10 tps: 264.53 qps: 5331.47 (r/w/o: 3733.32/1056.11/542.03) lat (ms,95%): 15.55 err/s: 5.99 reconn/s: 0.00
[ 123s ] thds: 10 tps: 1497.81 qps: 30183.57 (r/w/o: 21144.63/6011.27/3027.67) lat (ms,95%): 11.04 err/s: 11.02 reconn/s: 0.00
[ 124s ] thds: 10 tps: 1949.60 qps: 39076.86 (r/w/o: 27364.29/7787.39/3925.17) lat (ms,95%): 7.84 err/s: 6.99 reconn/s: 0.00
[ 125s ] thds: 10 tps: 2028.37 qps: 40708.52 (r/w/o: 28504.27/8119.49/4084.76) lat (ms,95%): 7.43 err/s: 5.00 reconn/s: 0.00
[ 126s ] thds: 10 tps: 2067.13 qps: 41455.59 (r/w/o: 29028.82/8260.52/4166.26) lat (ms,95%): 7.30 err/s: 7.00 reconn/s: 0.00
[ 127s ] thds: 10 tps: 1987.69 qps: 39839.74 (r/w/o: 27894.62/7938.75/4006.37) lat (ms,95%): 7.43 err/s: 7.00 reconn/s: 0.00
[ 128s ] thds: 10 tps: 1973.16 qps: 39790.25 (r/w/o: 27875.27/7921.65/3993.33) lat (ms,95%): 7.70 err/s: 17.00 reconn/s: 0.00
[ 129s ] thds: 10 tps: 2029.13 qps: 40744.56 (r/w/o: 28533.80/8118.51/4092.26) lat (ms,95%): 7.30 err/s: 10.00 reconn/s: 0.00
[ 130s ] thds: 10 tps: 1778.19 qps: 35714.69 (r/w/o: 25014.58/7124.75/3575.37) lat (ms,95%): 8.28 err/s: 7.00 reconn/s: 0.00
[ 131s ] thds: 10 tps: 1927.73 qps: 38843.70 (r/w/o: 27214.30/7724.92/3904.48) lat (ms,95%): 7.84 err/s: 16.01 reconn/s: 0.00
[ 132s ] thds: 10 tps: 2003.01 qps: 40185.21 (r/w/o: 28139.15/8012.04/4034.02) lat (ms,95%): 7.43 err/s: 7.00 reconn/s: 0.00
[ 133s ] thds: 10 tps: 2022.93 qps: 40575.60 (r/w/o: 28416.02/8085.72/4073.86) lat (ms,95%): 7.30 err/s: 7.00 reconn/s: 0.00
[ 134s ] thds: 10 tps: 1973.16 qps: 39735.15 (r/w/o: 27827.21/7916.63/3991.32) lat (ms,95%): 7.84 err/s: 13.00 reconn/s: 0.00
[ 135s ] thds: 10 tps: 1969.06 qps: 39490.20 (r/w/o: 27656.84/7868.24/3965.12) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 136s ] thds: 10 tps: 1805.01 qps: 36237.03 (r/w/o: 25371.01/7220.04/3645.98) lat (ms,95%): 10.09 err/s: 7.99 reconn/s: 0.00
[ 137s ] thds: 10 tps: 318.73 qps: 6433.62 (r/w/o: 4519.22/1274.93/639.46) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 138s ] thds: 10 tps: 1060.57 qps: 21296.54 (r/w/o: 14904.07/4253.30/2139.17) lat (ms,95%): 14.46 err/s: 7.01 reconn/s: 0.00
[ 139s ] thds: 10 tps: 1847.74 qps: 37126.80 (r/w/o: 25996.36/7407.95/3722.48) lat (ms,95%): 8.28 err/s: 10.00 reconn/s: 0.00
[ 140s ] thds: 10 tps: 1830.29 qps: 36724.49 (r/w/o: 25723.81/7310.17/3690.51) lat (ms,95%): 8.58 err/s: 5.99 reconn/s: 0.00
[ 141s ] thds: 10 tps: 1829.43 qps: 36771.93 (r/w/o: 25756.28/7325.73/3689.92) lat (ms,95%): 8.13 err/s: 11.02 reconn/s: 0.00
[ 142s ] thds: 10 tps: 1832.29 qps: 36763.65 (r/w/o: 25748.94/7321.16/3693.55) lat (ms,95%): 8.13 err/s: 5.99 reconn/s: 0.00
[ 143s ] thds: 10 tps: 1919.19 qps: 38462.93 (r/w/o: 26922.75/7673.76/3866.42) lat (ms,95%): 9.22 err/s: 7.01 reconn/s: 0.00
[ 144s ] thds: 10 tps: 1993.02 qps: 40059.44 (r/w/o: 28060.31/7980.09/4019.04) lat (ms,95%): 7.56 err/s: 8.00 reconn/s: 0.00
[ 145s ] thds: 10 tps: 2038.00 qps: 40839.06 (r/w/o: 28588.04/8151.01/4100.01) lat (ms,95%): 7.30 err/s: 4.00 reconn/s: 0.00
[ 146s ] thds: 10 tps: 2008.99 qps: 40356.71 (r/w/o: 28266.80/8028.94/4060.97) lat (ms,95%): 7.43 err/s: 12.00 reconn/s: 0.00
[ 147s ] thds: 10 tps: 1903.87 qps: 38251.46 (r/w/o: 26789.22/7622.49/3839.75) lat (ms,95%): 8.13 err/s: 7.00 reconn/s: 0.00
[ 148s ] thds: 10 tps: 1747.04 qps: 35009.85 (r/w/o: 24522.60/6975.17/3512.09) lat (ms,95%): 10.27 err/s: 5.00 reconn/s: 0.00
[ 149s ] thds: 10 tps: 1837.63 qps: 36850.42 (r/w/o: 25791.70/7360.50/3698.22) lat (ms,95%): 8.58 err/s: 4.99 reconn/s: 0.00
[ 150s ] thds: 10 tps: 1847.33 qps: 37024.73 (r/w/o: 25934.74/7365.27/3724.71) lat (ms,95%): 9.56 err/s: 4.01 reconn/s: 0.00
[ 151s ] thds: 10 tps: 1834.97 qps: 36864.31 (r/w/o: 25802.52/7359.86/3701.93) lat (ms,95%): 9.22 err/s: 12.00 reconn/s: 0.00
[ 152s ] thds: 10 tps: 1770.83 qps: 35538.32 (r/w/o: 24888.40/7078.32/3571.60) lat (ms,95%): 10.09 err/s: 6.99 reconn/s: 0.00
[ 153s ] thds: 10 tps: 1887.54 qps: 37870.06 (r/w/o: 26519.76/7551.17/3799.13) lat (ms,95%): 8.74 err/s: 4.01 reconn/s: 0.00
[ 154s ] thds: 10 tps: 1877.93 qps: 37663.58 (r/w/o: 26374.00/7506.72/3782.86) lat (ms,95%): 10.09 err/s: 7.00 reconn/s: 0.00
[ 155s ] thds: 10 tps: 1952.03 qps: 39181.66 (r/w/o: 27441.46/7807.13/3933.07) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 156s ] thds: 10 tps: 1934.96 qps: 38830.12 (r/w/o: 27189.38/7743.82/3896.91) lat (ms,95%): 7.70 err/s: 8.00 reconn/s: 0.00
[ 157s ] thds: 10 tps: 1929.46 qps: 38687.21 (r/w/o: 27093.44/7706.87/3886.91) lat (ms,95%): 7.98 err/s: 6.00 reconn/s: 0.00
[ 158s ] thds: 10 tps: 1898.60 qps: 38158.23 (r/w/o: 26715.56/7599.42/3843.25) lat (ms,95%): 8.28 err/s: 10.01 reconn/s: 0.00
[ 159s ] thds: 10 tps: 1981.97 qps: 39730.40 (r/w/o: 27817.58/7918.88/3993.94) lat (ms,95%): 7.70 err/s: 7.00 reconn/s: 0.00
[ 160s ] thds: 10 tps: 1952.84 qps: 39268.85 (r/w/o: 27510.79/7824.37/3933.68) lat (ms,95%): 8.74 err/s: 8.00 reconn/s: 0.00
[ 161s ] thds: 10 tps: 2021.15 qps: 40489.94 (r/w/o: 28351.06/8075.59/4063.29) lat (ms,95%): 7.70 err/s: 6.00 reconn/s: 0.00
[ 162s ] thds: 10 tps: 1990.02 qps: 40013.34 (r/w/o: 28021.24/7979.07/4013.03) lat (ms,95%): 7.56 err/s: 10.00 reconn/s: 0.00
[ 163s ] thds: 10 tps: 1796.04 qps: 36041.79 (r/w/o: 25244.55/7179.16/3618.08) lat (ms,95%): 10.27 err/s: 6.00 reconn/s: 0.00
[ 164s ] thds: 10 tps: 1808.48 qps: 36254.56 (r/w/o: 25379.69/7227.92/3646.95) lat (ms,95%): 8.90 err/s: 6.00 reconn/s: 0.00
[ 165s ] thds: 10 tps: 2016.54 qps: 40503.91 (r/w/o: 28357.64/8075.17/4071.10) lat (ms,95%): 7.43 err/s: 9.00 reconn/s: 0.00
[ 166s ] thds: 10 tps: 1837.02 qps: 36809.36 (r/w/o: 25782.25/7331.07/3696.04) lat (ms,95%): 8.74 err/s: 5.00 reconn/s: 0.00
[ 167s ] thds: 10 tps: 1891.98 qps: 37974.63 (r/w/o: 26595.74/7559.93/3818.96) lat (ms,95%): 7.70 err/s: 7.00 reconn/s: 0.00
[ 168s ] thds: 10 tps: 1939.85 qps: 39004.99 (r/w/o: 27322.89/7761.40/3920.70) lat (ms,95%): 7.98 err/s: 12.00 reconn/s: 0.00
[ 169s ] thds: 10 tps: 1974.66 qps: 39728.19 (r/w/o: 27827.23/7914.64/3986.32) lat (ms,95%): 7.56 err/s: 12.00 reconn/s: 0.00
[ 170s ] thds: 10 tps: 1783.48 qps: 35819.59 (r/w/o: 25076.72/7148.91/3593.96) lat (ms,95%): 9.06 err/s: 9.00 reconn/s: 0.00
[ 171s ] thds: 10 tps: 2019.91 qps: 40512.19 (r/w/o: 28367.73/8074.64/4069.82) lat (ms,95%): 7.43 err/s: 8.00 reconn/s: 0.00
[ 172s ] thds: 10 tps: 1946.05 qps: 39068.95 (r/w/o: 27358.67/7796.19/3914.10) lat (ms,95%): 7.56 err/s: 5.00 reconn/s: 0.00
[ 173s ] thds: 10 tps: 1180.90 qps: 23706.93 (r/w/o: 16610.55/4715.59/2380.79) lat (ms,95%): 7.43 err/s: 4.00 reconn/s: 0.00
[ 174s ] thds: 10 tps: 444.21 qps: 8860.26 (r/w/o: 6196.99/1767.86/895.41) lat (ms,95%): 15.27 err/s: 2.00 reconn/s: 0.00
[ 175s ] thds: 10 tps: 1580.88 qps: 31792.79 (r/w/o: 22266.46/6333.54/3192.79) lat (ms,95%): 10.27 err/s: 9.01 reconn/s: 0.00
[ 176s ] thds: 10 tps: 635.50 qps: 12809.92 (r/w/o: 8980.93/2548.00/1280.99) lat (ms,95%): 7.43 err/s: 3.00 reconn/s: 0.00
[ 177s ] thds: 10 tps: 929.26 qps: 18689.42 (r/w/o: 13094.81/3715.05/1879.56) lat (ms,95%): 13.46 err/s: 8.01 reconn/s: 0.00
[ 178s ] thds: 10 tps: 1809.17 qps: 36270.39 (r/w/o: 25380.37/7249.68/3640.35) lat (ms,95%): 9.39 err/s: 5.00 reconn/s: 0.00
[ 179s ] thds: 10 tps: 1804.01 qps: 36243.10 (r/w/o: 25389.06/7217.04/3637.00) lat (ms,95%): 9.22 err/s: 8.00 reconn/s: 0.00
[ 180s ] thds: 10 tps: 2025.30 qps: 40718.13 (r/w/o: 28525.30/8099.20/4093.63) lat (ms,95%): 7.30 err/s: 13.01 reconn/s: 0.00
[ 181s ] thds: 10 tps: 2006.93 qps: 40264.67 (r/w/o: 28184.07/8033.73/4046.87) lat (ms,95%): 7.56 err/s: 8.00 reconn/s: 0.00
[ 182s ] thds: 10 tps: 2024.94 qps: 40684.72 (r/w/o: 28501.10/8093.75/4089.87) lat (ms,95%): 7.30 err/s: 9.00 reconn/s: 0.00
[ 183s ] thds: 10 tps: 1099.97 qps: 22087.49 (r/w/o: 15475.65/4399.90/2211.95) lat (ms,95%): 7.30 err/s: 3.00 reconn/s: 0.00
[ 184s ] thds: 10 tps: 569.92 qps: 11451.32 (r/w/o: 8007.84/2285.67/1157.81) lat (ms,95%): 14.21 err/s: 5.99 reconn/s: 0.00
[ 185s ] thds: 10 tps: 1513.98 qps: 30426.97 (r/w/o: 21317.01/6054.93/3055.02) lat (ms,95%): 11.65 err/s: 7.01 reconn/s: 0.00
[ 186s ] thds: 10 tps: 1823.81 qps: 36556.22 (r/w/o: 25593.35/7290.25/3672.62) lat (ms,95%): 9.91 err/s: 5.00 reconn/s: 0.00
[ 187s ] thds: 10 tps: 1963.21 qps: 39261.23 (r/w/o: 27476.96/7837.85/3946.43) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 188s ] thds: 10 tps: 1938.87 qps: 39061.38 (r/w/o: 27368.17/7775.48/3917.74) lat (ms,95%): 7.70 err/s: 12.00 reconn/s: 0.00
[ 189s ] thds: 10 tps: 2044.11 qps: 40993.17 (r/w/o: 28710.52/8175.43/4107.22) lat (ms,95%): 7.30 err/s: 5.00 reconn/s: 0.00
[ 190s ] thds: 10 tps: 1978.80 qps: 39681.97 (r/w/o: 27781.18/7910.21/3990.58) lat (ms,95%): 7.70 err/s: 7.00 reconn/s: 0.00
[ 191s ] thds: 10 tps: 2026.30 qps: 40744.07 (r/w/o: 28539.26/8107.19/4097.62) lat (ms,95%): 7.30 err/s: 13.01 reconn/s: 0.00
[ 192s ] thds: 10 tps: 2034.98 qps: 40935.59 (r/w/o: 28670.71/8159.92/4104.96) lat (ms,95%): 7.43 err/s: 11.00 reconn/s: 0.00
[ 193s ] thds: 10 tps: 2010.02 qps: 40355.42 (r/w/o: 28269.30/8036.08/4050.04) lat (ms,95%): 7.56 err/s: 8.00 reconn/s: 0.00
[ 194s ] thds: 10 tps: 1925.84 qps: 38652.84 (r/w/o: 27061.79/7707.37/3883.68) lat (ms,95%): 7.70 err/s: 9.00 reconn/s: 0.00
[ 195s ] thds: 10 tps: 1949.11 qps: 39090.27 (r/w/o: 27368.59/7790.45/3931.23) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 196s ] thds: 10 tps: 1840.02 qps: 36872.49 (r/w/o: 25816.34/7353.10/3703.05) lat (ms,95%): 9.22 err/s: 4.00 reconn/s: 0.00
[ 197s ] thds: 10 tps: 1996.79 qps: 40225.82 (r/w/o: 28187.07/8007.17/4031.58) lat (ms,95%): 7.56 err/s: 14.00 reconn/s: 0.00
[ 198s ] thds: 10 tps: 123.75 qps: 2462.08 (r/w/o: 1725.55/487.03/249.50) lat (ms,95%): 926.33 err/s: 1.00 reconn/s: 0.00
[ 199s ] thds: 10 tps: 1199.99 qps: 24118.90 (r/w/o: 16885.93/4812.96/2420.00) lat (ms,95%): 13.95 err/s: 6.01 reconn/s: 0.00
[ 200s ] thds: 10 tps: 1898.83 qps: 38115.57 (r/w/o: 26699.60/7590.30/3825.66) lat (ms,95%): 8.13 err/s: 8.00 reconn/s: 0.00
[ 201s ] thds: 10 tps: 2013.01 qps: 40539.17 (r/w/o: 28395.12/8067.03/4077.02) lat (ms,95%): 7.56 err/s: 15.00 reconn/s: 0.00
[ 202s ] thds: 10 tps: 1954.18 qps: 39210.62 (r/w/o: 27462.53/7804.74/3943.35) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 203s ] thds: 10 tps: 1764.26 qps: 35385.21 (r/w/o: 24776.64/7054.05/3554.51) lat (ms,95%): 7.56 err/s: 4.00 reconn/s: 0.00
[ 204s ] thds: 10 tps: 318.64 qps: 6317.92 (r/w/o: 4407.06/1269.58/641.28) lat (ms,95%): 15.00 err/s: 1.00 reconn/s: 0.00
[ 205s ] thds: 10 tps: 1537.86 qps: 30846.29 (r/w/o: 21599.11/6152.44/3094.74) lat (ms,95%): 11.45 err/s: 4.00 reconn/s: 0.00
[ 206s ] thds: 10 tps: 415.45 qps: 8392.89 (r/w/o: 5891.20/1667.79/833.90) lat (ms,95%): 8.74 err/s: 1.00 reconn/s: 0.00
[ 207s ] thds: 10 tps: 1126.77 qps: 22563.42 (r/w/o: 15793.79/4498.06/2271.57) lat (ms,95%): 13.70 err/s: 6.01 reconn/s: 0.00
[ 208s ] thds: 10 tps: 1827.93 qps: 36715.66 (r/w/o: 25718.07/7308.71/3688.87) lat (ms,95%): 8.28 err/s: 7.00 reconn/s: 0.00
[ 209s ] thds: 10 tps: 2036.93 qps: 40939.65 (r/w/o: 28663.06/8155.73/4120.86) lat (ms,95%): 7.43 err/s: 12.00 reconn/s: 0.00
[ 210s ] thds: 10 tps: 1968.95 qps: 39529.95 (r/w/o: 27684.26/7873.79/3971.89) lat (ms,95%): 7.56 err/s: 9.00 reconn/s: 0.00
[ 211s ] thds: 10 tps: 1913.97 qps: 38522.45 (r/w/o: 26987.61/7663.89/3870.94) lat (ms,95%): 7.84 err/s: 13.00 reconn/s: 0.00
[ 212s ] thds: 10 tps: 2040.68 qps: 41028.50 (r/w/o: 28734.45/8172.71/4121.35) lat (ms,95%): 7.30 err/s: 10.00 reconn/s: 0.00
[ 213s ] thds: 10 tps: 1979.76 qps: 39712.06 (r/w/o: 27806.54/7914.03/3991.49) lat (ms,95%): 7.84 err/s: 9.99 reconn/s: 0.00
[ 214s ] thds: 10 tps: 2054.81 qps: 41241.41 (r/w/o: 28885.50/8221.26/4134.65) lat (ms,95%): 7.43 err/s: 7.01 reconn/s: 0.00
[ 215s ] thds: 10 tps: 2028.77 qps: 40741.41 (r/w/o: 28533.78/8125.08/4082.54) lat (ms,95%): 7.30 err/s: 7.00 reconn/s: 0.00
[ 216s ] thds: 10 tps: 2025.22 qps: 40645.43 (r/w/o: 28455.10/8100.88/4089.45) lat (ms,95%): 7.30 err/s: 10.00 reconn/s: 0.00
[ 217s ] thds: 10 tps: 2000.97 qps: 40148.35 (r/w/o: 28116.54/8002.87/4028.93) lat (ms,95%): 7.30 err/s: 6.00 reconn/s: 0.00
[ 218s ] thds: 10 tps: 1830.00 qps: 36639.94 (r/w/o: 25653.96/7309.99/3675.99) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 219s ] thds: 10 tps: 2020.03 qps: 40636.57 (r/w/o: 28455.40/8094.11/4087.06) lat (ms,95%): 7.43 err/s: 14.00 reconn/s: 0.00
[ 220s ] thds: 10 tps: 1996.01 qps: 40083.11 (r/w/o: 28072.08/7987.02/4024.01) lat (ms,95%): 7.43 err/s: 9.00 reconn/s: 0.00
[ 221s ] thds: 10 tps: 2067.99 qps: 41421.72 (r/w/o: 29010.80/8251.94/4158.97) lat (ms,95%): 7.30 err/s: 3.00 reconn/s: 0.00
[ 222s ] thds: 10 tps: 1948.99 qps: 39088.78 (r/w/o: 27358.84/7797.96/3931.98) lat (ms,95%): 7.98 err/s: 7.00 reconn/s: 0.00
[ 223s ] thds: 10 tps: 2031.01 qps: 40755.15 (r/w/o: 28548.10/8115.03/4092.01) lat (ms,95%): 7.43 err/s: 7.00 reconn/s: 0.00
[ 224s ] thds: 10 tps: 1931.91 qps: 38817.17 (r/w/o: 27188.72/7732.64/3895.82) lat (ms,95%): 7.98 err/s: 7.00 reconn/s: 0.00
[ 225s ] thds: 10 tps: 1917.07 qps: 38421.45 (r/w/o: 26894.01/7664.29/3863.15) lat (ms,95%): 7.98 err/s: 7.00 reconn/s: 0.00
[ 226s ] thds: 10 tps: 1995.86 qps: 40112.14 (r/w/o: 28097.00/7987.43/4027.71) lat (ms,95%): 7.43 err/s: 9.00 reconn/s: 0.00
[ 227s ] thds: 10 tps: 2044.16 qps: 41071.13 (r/w/o: 28766.20/8179.62/4125.31) lat (ms,95%): 7.43 err/s: 12.00 reconn/s: 0.00
[ 228s ] thds: 10 tps: 1827.69 qps: 36696.69 (r/w/o: 25696.58/7311.74/3688.37) lat (ms,95%): 8.74 err/s: 7.00 reconn/s: 0.00
[ 229s ] thds: 10 tps: 1821.32 qps: 36561.49 (r/w/o: 25597.54/7288.29/3675.65) lat (ms,95%): 9.39 err/s: 9.00 reconn/s: 0.00
[ 230s ] thds: 10 tps: 1980.84 qps: 39881.83 (r/w/o: 27939.78/7937.37/4004.68) lat (ms,95%): 7.84 err/s: 14.00 reconn/s: 0.00
[ 231s ] thds: 10 tps: 2071.17 qps: 41530.38 (r/w/o: 29085.36/8275.67/4169.34) lat (ms,95%): 7.17 err/s: 6.00 reconn/s: 0.00
[ 232s ] thds: 10 tps: 1977.00 qps: 39835.91 (r/w/o: 27901.93/7931.98/4001.99) lat (ms,95%): 8.43 err/s: 15.00 reconn/s: 0.00
[ 233s ] thds: 10 tps: 2042.91 qps: 41023.11 (r/w/o: 28741.68/8166.62/4114.81) lat (ms,95%): 7.56 err/s: 10.00 reconn/s: 0.00
[ 234s ] thds: 10 tps: 544.87 qps: 10952.38 (r/w/o: 7667.17/2189.48/1095.74) lat (ms,95%): 7.43 err/s: 1.00 reconn/s: 0.00
[ 235s ] thds: 10 tps: 885.94 qps: 17821.98 (r/w/o: 12479.29/3554.78/1787.90) lat (ms,95%): 13.46 err/s: 6.01 reconn/s: 0.00
[ 236s ] thds: 10 tps: 1752.83 qps: 35185.77 (r/w/o: 24636.74/7006.32/3542.70) lat (ms,95%): 9.22 err/s: 8.01 reconn/s: 0.00
[ 237s ] thds: 10 tps: 1919.90 qps: 38351.91 (r/w/o: 26842.53/7657.58/3851.79) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 238s ] thds: 10 tps: 1933.11 qps: 38731.24 (r/w/o: 27126.57/7720.45/3884.22) lat (ms,95%): 9.73 err/s: 2.00 reconn/s: 0.00
[ 239s ] thds: 10 tps: 1972.95 qps: 39697.09 (r/w/o: 27803.36/7909.82/3983.91) lat (ms,95%): 7.43 err/s: 12.00 reconn/s: 0.00
[ 240s ] thds: 10 tps: 1744.78 qps: 35049.33 (r/w/o: 24540.72/6979.12/3529.49) lat (ms,95%): 10.65 err/s: 11.98 reconn/s: 0.00
[ 241s ] thds: 10 tps: 1709.17 qps: 34290.51 (r/w/o: 24015.48/6834.66/3440.37) lat (ms,95%): 10.84 err/s: 4.01 reconn/s: 0.00
[ 242s ] thds: 10 tps: 1913.04 qps: 38387.80 (r/w/o: 26880.56/7661.16/3846.08) lat (ms,95%): 7.98 err/s: 6.00 reconn/s: 0.00
[ 243s ] thds: 10 tps: 1848.98 qps: 36998.63 (r/w/o: 25894.74/7378.93/3724.96) lat (ms,95%): 8.28 err/s: 4.00 reconn/s: 0.00
[ 244s ] thds: 10 tps: 1993.95 qps: 40114.89 (r/w/o: 28101.23/7992.78/4020.89) lat (ms,95%): 7.56 err/s: 8.00 reconn/s: 0.00
[ 245s ] thds: 10 tps: 1849.05 qps: 37134.95 (r/w/o: 26007.66/7386.19/3741.10) lat (ms,95%): 8.43 err/s: 12.00 reconn/s: 0.00
[ 246s ] thds: 10 tps: 1934.57 qps: 38810.31 (r/w/o: 27176.91/7736.27/3897.13) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 247s ] thds: 10 tps: 1883.43 qps: 37812.61 (r/w/o: 26477.03/7538.72/3796.86) lat (ms,95%): 8.74 err/s: 7.00 reconn/s: 0.00
[ 248s ] thds: 10 tps: 1822.97 qps: 36652.37 (r/w/o: 25674.56/7294.88/3682.94) lat (ms,95%): 8.90 err/s: 11.00 reconn/s: 0.00
[ 249s ] thds: 10 tps: 1954.98 qps: 39192.64 (r/w/o: 27447.75/7814.93/3929.96) lat (ms,95%): 7.70 err/s: 4.00 reconn/s: 0.00
[ 250s ] thds: 10 tps: 1664.03 qps: 33529.58 (r/w/o: 23490.40/6676.11/3363.06) lat (ms,95%): 10.46 err/s: 12.00 reconn/s: 0.00
[ 251s ] thds: 10 tps: 106.79 qps: 2134.73 (r/w/o: 1492.01/424.15/218.56) lat (ms,95%): 943.16 err/s: 2.00 reconn/s: 0.00
[ 252s ] thds: 10 tps: 1114.66 qps: 22342.34 (r/w/o: 15649.35/4449.64/2243.35) lat (ms,95%): 14.21 err/s: 2.00 reconn/s: 0.00
[ 253s ] thds: 10 tps: 1685.61 qps: 33789.27 (r/w/o: 23648.59/6750.45/3390.23) lat (ms,95%): 10.46 err/s: 6.00 reconn/s: 0.00
[ 254s ] thds: 10 tps: 1929.86 qps: 38639.14 (r/w/o: 27056.99/7707.44/3874.71) lat (ms,95%): 7.56 err/s: 3.00 reconn/s: 0.00
[ 255s ] thds: 10 tps: 1976.43 qps: 39699.82 (r/w/o: 27797.18/7907.74/3994.90) lat (ms,95%): 7.56 err/s: 10.01 reconn/s: 0.00
[ 256s ] thds: 10 tps: 1928.04 qps: 38745.75 (r/w/o: 27135.53/7721.15/3889.08) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 257s ] thds: 10 tps: 1990.88 qps: 39934.65 (r/w/o: 27969.36/7958.53/4006.76) lat (ms,95%): 7.56 err/s: 6.00 reconn/s: 0.00
[ 258s ] thds: 10 tps: 1868.64 qps: 37561.47 (r/w/o: 26305.71/7483.53/3772.23) lat (ms,95%): 7.98 err/s: 9.99 reconn/s: 0.00
[ 259s ] thds: 10 tps: 1791.04 qps: 35901.98 (r/w/o: 25139.70/7154.17/3608.12) lat (ms,95%): 9.22 err/s: 6.01 reconn/s: 0.00
[ 260s ] thds: 10 tps: 1749.13 qps: 35073.55 (r/w/o: 24557.79/6993.51/3522.26) lat (ms,95%): 10.27 err/s: 8.00 reconn/s: 0.00
[ 261s ] thds: 10 tps: 1950.20 qps: 39148.96 (r/w/o: 27407.77/7803.79/3937.40) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
[ 262s ] thds: 10 tps: 1941.02 qps: 38877.35 (r/w/o: 27222.24/7745.07/3910.04) lat (ms,95%): 7.84 err/s: 5.00 reconn/s: 0.00
[ 263s ] thds: 10 tps: 1812.47 qps: 36428.08 (r/w/o: 25519.32/7248.89/3659.87) lat (ms,95%): 8.74 err/s: 9.98 reconn/s: 0.00
[ 264s ] thds: 10 tps: 1798.39 qps: 36075.97 (r/w/o: 25253.58/7201.57/3620.82) lat (ms,95%): 8.90 err/s: 5.01 reconn/s: 0.00
[ 265s ] thds: 10 tps: 1895.08 qps: 38042.56 (r/w/o: 26638.09/7579.31/3825.16) lat (ms,95%): 7.84 err/s: 9.00 reconn/s: 0.00
[ 266s ] thds: 10 tps: 1774.99 qps: 35684.75 (r/w/o: 25002.83/7088.95/3592.98) lat (ms,95%): 8.58 err/s: 11.00 reconn/s: 0.00
[ 267s ] thds: 10 tps: 1934.88 qps: 38839.62 (r/w/o: 27193.34/7749.53/3896.76) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
[ 268s ] thds: 10 tps: 1690.15 qps: 33870.97 (r/w/o: 23713.08/6747.59/3410.30) lat (ms,95%): 10.84 err/s: 6.00 reconn/s: 0.00
[ 269s ] thds: 10 tps: 1918.89 qps: 38475.74 (r/w/o: 26939.42/7666.55/3869.77) lat (ms,95%): 7.84 err/s: 6.00 reconn/s: 0.00
[ 270s ] thds: 10 tps: 1997.12 qps: 40147.36 (r/w/o: 28132.66/7984.47/4030.24) lat (ms,95%): 7.43 err/s: 10.00 reconn/s: 0.00
[ 271s ] thds: 10 tps: 1925.95 qps: 38629.04 (r/w/o: 27042.33/7706.81/3879.90) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
[ 272s ] thds: 10 tps: 1970.01 qps: 39556.17 (r/w/o: 27702.12/7876.03/3978.02) lat (ms,95%): 7.70 err/s: 9.00 reconn/s: 0.00
[ 273s ] thds: 10 tps: 1892.69 qps: 37990.84 (r/w/o: 26604.69/7559.78/3826.38) lat (ms,95%): 8.74 err/s: 9.00 reconn/s: 0.00
[ 274s ] thds: 10 tps: 1930.36 qps: 38694.27 (r/w/o: 27086.09/7728.45/3879.73) lat (ms,95%): 7.70 err/s: 4.00 reconn/s: 0.00
[ 275s ] thds: 10 tps: 429.09 qps: 8654.67 (r/w/o: 6077.13/1710.38/867.16) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 276s ] thds: 10 tps: 1037.73 qps: 20774.71 (r/w/o: 14530.28/4157.95/2086.49) lat (ms,95%): 13.70 err/s: 3.01 reconn/s: 0.00
[ 277s ] thds: 10 tps: 1875.79 qps: 37599.80 (r/w/o: 26324.06/7495.15/3780.59) lat (ms,95%): 8.58 err/s: 7.00 reconn/s: 0.00
[ 278s ] thds: 10 tps: 1867.03 qps: 37528.56 (r/w/o: 26290.39/7470.11/3768.06) lat (ms,95%): 10.27 err/s: 9.00 reconn/s: 0.00
[ 279s ] thds: 10 tps: 1951.94 qps: 39157.81 (r/w/o: 27423.17/7804.76/3929.88) lat (ms,95%): 8.43 err/s: 7.00 reconn/s: 0.00
[ 280s ] thds: 10 tps: 2005.95 qps: 40290.92 (r/w/o: 28217.24/8028.78/4044.89) lat (ms,95%): 7.43 err/s: 9.00 reconn/s: 0.00
[ 281s ] thds: 10 tps: 2016.13 qps: 40501.54 (r/w/o: 28358.78/8085.51/4057.25) lat (ms,95%): 7.56 err/s: 8.00 reconn/s: 0.00
[ 282s ] thds: 10 tps: 2006.91 qps: 40320.19 (r/w/o: 28248.73/8018.64/4052.82) lat (ms,95%): 7.43 err/s: 11.00 reconn/s: 0.00
[ 283s ] thds: 10 tps: 1988.03 qps: 39852.61 (r/w/o: 27905.43/7933.12/4014.06) lat (ms,95%): 7.43 err/s: 5.00 reconn/s: 0.00
[ 284s ] thds: 10 tps: 1998.00 qps: 40183.03 (r/w/o: 28142.02/8000.01/4041.00) lat (ms,95%): 7.56 err/s: 13.00 reconn/s: 0.00
[ 285s ] thds: 10 tps: 1982.71 qps: 39852.20 (r/w/o: 27901.94/7950.84/3999.42) lat (ms,95%): 7.70 err/s: 11.00 reconn/s: 0.00
[ 286s ] thds: 10 tps: 1589.27 qps: 31919.25 (r/w/o: 22361.65/6352.11/3205.50) lat (ms,95%): 10.84 err/s: 5.99 reconn/s: 0.00
[ 287s ] thds: 10 tps: 1630.93 qps: 32654.71 (r/w/o: 22863.10/6504.69/3286.91) lat (ms,95%): 10.65 err/s: 5.01 reconn/s: 0.00
[ 288s ] thds: 10 tps: 1905.53 qps: 38291.34 (r/w/o: 26816.22/7628.11/3847.01) lat (ms,95%): 8.13 err/s: 6.99 reconn/s: 0.00
[ 289s ] thds: 10 tps: 1711.27 qps: 34269.51 (r/w/o: 23983.85/6843.09/3442.57) lat (ms,95%): 10.27 err/s: 4.01 reconn/s: 0.00
[ 290s ] thds: 10 tps: 1790.10 qps: 35906.92 (r/w/o: 25140.34/7158.38/3608.19) lat (ms,95%): 9.91 err/s: 8.00 reconn/s: 0.00
[ 291s ] thds: 10 tps: 1962.91 qps: 39388.19 (r/w/o: 27585.73/7851.64/3950.82) lat (ms,95%): 7.84 err/s: 6.00 reconn/s: 0.00
[ 292s ] thds: 10 tps: 1845.61 qps: 37004.10 (r/w/o: 25911.45/7378.46/3714.18) lat (ms,95%): 8.28 err/s: 4.99 reconn/s: 0.00
[ 293s ] thds: 10 tps: 1895.61 qps: 38138.54 (r/w/o: 26713.81/7593.44/3831.29) lat (ms,95%): 7.84 err/s: 12.02 reconn/s: 0.00
[ 294s ] thds: 10 tps: 2022.00 qps: 40595.05 (r/w/o: 28431.03/8085.01/4079.00) lat (ms,95%): 7.43 err/s: 10.00 reconn/s: 0.00
[ 295s ] thds: 10 tps: 1869.80 qps: 37551.93 (r/w/o: 26286.15/7500.19/3765.59) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 296s ] thds: 10 tps: 1937.21 qps: 38883.21 (r/w/o: 27245.95/7733.84/3903.42) lat (ms,95%): 7.70 err/s: 8.00 reconn/s: 0.00
[ 297s ] thds: 10 tps: 242.51 qps: 4829.26 (r/w/o: 3375.19/966.05/488.02) lat (ms,95%): 12.30 err/s: 1.00 reconn/s: 0.00
[ 298s ] thds: 10 tps: 1149.54 qps: 23014.83 (r/w/o: 16110.58/4594.15/2310.09) lat (ms,95%): 13.46 err/s: 2.00 reconn/s: 0.00
[ 299s ] thds: 10 tps: 1814.19 qps: 36450.85 (r/w/o: 25532.71/7254.75/3663.40) lat (ms,95%): 8.58 err/s: 10.01 reconn/s: 0.00
[ 300s ] thds: 10 tps: 1908.96 qps: 38394.17 (r/w/o: 26893.42/7645.84/3854.92) lat (ms,95%): 7.84 err/s: 11.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7600866
        write:                           2162907
        other:                           1090143
        total:                           10853916
    transactions:                        540698 (1802.24 per sec.)
    queries:                             10853916 (36177.92 per sec.)
    ignored errors:                      2221   (7.40 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0128s
    total number of events:              540698

Latency (ms):
         min:                                    3.43
         avg:                                    5.55
         max:                                 1025.00
         95th percentile:                        8.28
         sum:                              2998995.14

Threads fairness:
    events (avg/stddev):           54069.8000/243.23
    execution time (avg/stddev):   299.8995/0.00